Autodesk.Revit.DB.Structure.ConnectedElementOrder
Remarks:
It's exposed in internal API.
Enumerated type describing order of connected elements required by connection type.
Since:
2017

Autodesk.Revit.DB.Structure.ConnectedElementOrder.FullOrder
Elements are ordered, starting from primary element.

Autodesk.Revit.DB.Structure.ConnectedElementOrder.PrimaryElement
There is one primary element.

Autodesk.Revit.DB.Structure.ConnectedElementOrder.None
All connected elements are equivalent, no special element.